{"singlePage": [], "startSite": "", "filingNum": "", "onePageListNum": 15, "commentLabelColor": "#006b75", "yearColorList": ["#bc4c00", "#0969da", "#1f883d", "#A333D0"], "i18n": "CN", "themeMode": "manual", "dayTheme": "light", "nightTheme": "dark", "urlMode": "pinyin", "script": "", "style": "", "head": "", "indexScript": "", "indexStyle": "", "bottomText": "", "showPostSource": 1, "iconList": {}, "UTC": 8, "rssSplit": "sentence", "exlink": {}, "needComment": 1, "allHead": "", "title": "Winnerineast Blog", "subTitle": "Humachine Studio", "avatarUrl": "https://github.githubassets.com/favicons/favicon.svg", "GMEEK_VERSION": "last", "postListJson": {"P1": {"htmlDir": "docs/post/【-lun-wen-tui-jian-】DeepResearch.html", "labels": ["paper"], "postTitle": "【论文推荐】DeepResearch", "postUrl": "post/%E3%80%90-lun-wen-tui-jian-%E3%80%91DeepResearch.html", "postSourceUrl": "https://github.com/winnerineast/winnerineast.github.io/issues/1", "commentNum": 0, "wordCount": 901, "description": "（好一些的综述）[https://arxiv.org/abs/2506.18096](https://t.co/KqENoLuAiv) \n（过于求全反而缺乏洞见的综述） [https://arxiv.org/pdf/2506.12594](https://t.co/xeWo94wXZq) \n（评估方法，从报告质量和引用精度两个角度评估）[https://arxiv.org/pdf/2506.11763](https://t.co/vKR0NO4HLO)\n\n（推荐，带UI，字节开源的基于LangGraph的DeepFlow）[https://github.com/bytedance/deer-flow…](https://t.co/EtqKMqlKBf) \n（推荐，带UI，Gemini基于LangGraph的Deep Search实现，比较简单） [https://github.com/google-gemini/gemini-fullstack-langgraph-quickstart…](https://t.co/VTe064Fsx2) \n（没有UI，但是功能比较丰富）[https://github.com/foreveryh/mentis/tree/main/super_agents/deep_research…](https://t.co/9TJy0juGLG)\n[](https://t.co/VTe064Fsx2)\n（基于smolagents框架，比较简单）[https://github.com/huggingface/smolagents/tree/main/examples/open_deep_research…](https://t.co/9wXwCsbxeL) （基于OpenAI Agents 库实现，比较简单） [https://huggingface.co/spaces/mallocode200/Deep_Research_Assistant/blob/main/research_manager.py](https://t.co/BaoHko5WT9)。", "top": 0, "createdAt": 1752315239, "style": "", "script": "", "head": "", "ogImage": "https://github.githubassets.com/favicons/favicon.svg", "createdDate": "2025-07-12", "dateLabelColor": "#0969da"}, "P2": {"htmlDir": "docs/post/AI-zhi-hui-yu-jian-suo-de-dian-feng-rong-he-：RAG-jie-suo-xia-yi-dai-xin-xi-sheng-cheng-xin-jia-gou.html", "labels": ["AI"], "postTitle": "AI智慧与检索的巅峰融合：RAG解锁下一代信息生成新架构", "postUrl": "post/AI-zhi-hui-yu-jian-suo-de-dian-feng-rong-he-%EF%BC%9ARAG-jie-suo-xia-yi-dai-xin-xi-sheng-cheng-xin-jia-gou.html", "postSourceUrl": "https://github.com/winnerineast/winnerineast.github.io/issues/2", "commentNum": 0, "wordCount": 1894, "description": "**GPTDAOCN-e/acc** @GPTDAOCN [2024-12-11](https://x.com/GPTDAOCN/status/1866947666690838557)\n\nAI智慧与检索的巅峰融合：RAG解锁下一代信息生成新架构\n\n这张图展示了'检索增强生成（Retrieval-Augmented Generation，RAG）'技术的不同架构，用来描述如何结合信息检索和生成式AI模型（如GPT）来更好地回答问题或生成内容。", "top": 0, "createdAt": 1752321646, "style": "", "script": "", "head": "", "ogImage": "https://github.githubassets.com/favicons/favicon.svg", "createdDate": "2025-07-12", "dateLabelColor": "#0969da"}, "P3": {"htmlDir": "docs/post/Building effective agents.html", "labels": ["AI"], "postTitle": "Building effective agents", "postUrl": "post/Building%20effective%20agents.html", "postSourceUrl": "https://github.com/winnerineast/winnerineast.github.io/issues/3", "commentNum": 0, "wordCount": 18822, "description": "Over the past year, we've worked with dozens of teams building large language model (LLM) agents across industries. Consistently, the most successful implementations weren't using complex frameworks or specialized libraries. Instead, they were building with simple, composable patterns.\n\nIn this post, we share what we’ve learned from working with our customers and building agents ourselves, and give practical advice for developers on building effective agents.\n\n## What are agents?\n\n'Agent' can be defined in several ways. Some customers define agents as fully autonomous systems that operate independently over extended periods, using various tools to accomplish complex tasks. Others use the term to describe more prescriptive implementations that follow predefined workflows. At Anthropic, we categorize all these variations as **agentic systems**, but draw an important architectural distinction between **workflows** and **agents**:\n\n- **Workflows** are systems where LLMs and tools are orchestrated through predefined code paths.\n- **Agents**, on the other hand, are systems where LLMs dynamically direct their own processes and tool usage, maintaining control over how they accomplish tasks.\n\nBelow, we will explore both types of agentic systems in detail. In Appendix 1 (“Agents in Practice”), we describe two domains where customers have found particular value in using these kinds of systems.\n\n## When (and when not) to use agents\n\nWhen building applications with LLMs, we recommend finding the simplest solution possible, and only increasing complexity when needed. This might mean not building agentic systems at all. Agentic systems often trade latency and cost for better task performance, and you should consider when this tradeoff makes sense.\n\nWhen more complexity is warranted, workflows offer predictability and consistency for well-defined tasks, whereas agents are the better option when flexibility and model-driven decision-making are needed at scale. For many applications, however, optimizing single LLM calls with retrieval and in-context examples is usually enough.\n\n## When and how to use frameworks\n\nThere are many frameworks that make agentic systems easier to implement, including:\n\n- [LangGraph](https://langchain-ai.github.io/langgraph/) from LangChain;\n- Amazon Bedrock's [AI Agent framework](https://aws.amazon.com/bedrock/agents/);\n- [Rivet](https://rivet.ironcladapp.com/), a drag and drop GUI LLM workflow builder; and\n- [Vellum](https://www.vellum.ai/), another GUI tool for building and testing complex workflows.\n\nThese frameworks make it easy to get started by simplifying standard low-level tasks like calling LLMs, defining and parsing tools, and chaining calls together. However, they often create extra layers of abstraction that can obscure the underlying prompts ​​and responses, making them harder to debug. They can also make it tempting to add complexity when a simpler setup would suffice.\n\nWe suggest that developers start by using LLM APIs directly: many patterns can be implemented in a few lines of code. If you do use a framework, ensure you understand the underlying code. Incorrect assumptions about what's under the hood are a common source of customer error.\n\nSee our [cookbook](https://github.com/anthropics/anthropic-cookbook/tree/main/patterns/agents) for some sample implementations.\n\n## Building blocks, workflows, and agents\n\nIn this section, we’ll explore the common patterns for agentic systems we’ve seen in production. We'll start with our foundational building block—the augmented LLM—and progressively increase complexity, from simple compositional workflows to autonomous agents.\n\n### Building block: The augmented LLM\n\nThe basic building block of agentic systems is an LLM enhanced with augmentations such as retrieval, tools, and memory. Our current models can actively use these capabilities—generating their own search queries, selecting appropriate tools, and determining what information to retain.\n\nWe recommend focusing on two key aspects of the implementation: tailoring these capabilities to your specific use case and ensuring they provide an easy, well-documented interface for your LLM. While there are many ways to implement these augmentations, one approach is through our recently released [Model Context Protocol](https://www.anthropic.com/news/model-context-protocol), which allows developers to integrate with a growing ecosystem of third-party tools with a simple [client implementation](https://modelcontextprotocol.io/tutorials/building-a-client#building-mcp-clients).\n\nFor the remainder of this post, we'll assume each LLM call has access to these augmented capabilities.\n\n### Workflow: Prompt chaining\n\nPrompt chaining decomposes a task into a sequence of steps, where each LLM call processes the output of the previous one. You can add programmatic checks (see 'gate” in the diagram below) on any intermediate steps to ensure that the process is still on track.\n\n**When to use this workflow:** This workflow is ideal for situations where the task can be easily and cleanly decomposed into fixed subtasks. The main goal is to trade off latency for higher accuracy, by making each LLM call an easier task.\n\n**Examples where prompt chaining is useful:**\n\n- Generating Marketing copy, then translating it into a different language.\n- Writing an outline of a document, checking that the outline meets certain criteria, then writing the document based on the outline.\n\n### Workflow: Routing\n\nRouting classifies an input and directs it to a specialized followup task. This workflow allows for separation of concerns, and building more specialized prompts. Without this workflow, optimizing for one kind of input can hurt performance on other inputs.\n\n**When to use this workflow:** Routing works well for complex tasks where there are distinct categories that are better handled separately, and where classification can be handled accurately, either by an LLM or a more traditional classification model/algorithm.\n\n**Examples where routing is useful:**\n\n- Directing different types of customer service queries (general questions, refund requests, technical support) into different downstream processes, prompts, and tools.\n- Routing easy/common questions to smaller models like Claude 3.5 Haiku and hard/unusual questions to more capable models like Claude 3.5 Sonnet to optimize cost and speed.\n\n### Workflow: Parallelization\n\nLLMs can sometimes work simultaneously on a task and have their outputs aggregated programmatically. This workflow, parallelization, manifests in two key variations:\n\n- **Sectioning**: Breaking a task into independent subtasks run in parallel.\n- **Voting:** Running the same task multiple times to get diverse outputs.\n\n**When to use this workflow:** Parallelization is effective when the divided subtasks can be parallelized for speed, or when multiple perspectives or attempts are needed for higher confidence results. For complex tasks with multiple considerations, LLMs generally perform better when each consideration is handled by a separate LLM call, allowing focused attention on each specific aspect.\n\n**Examples where parallelization is useful:**\n\n- **Sectioning**:\n- Implementing guardrails where one model instance processes user queries while another screens them for inappropriate content or requests. This tends to perform better than having the same LLM call handle both guardrails and the core response.\n- Automating evals for evaluating LLM performance, where each LLM call evaluates a different aspect of the model’s performance on a given prompt.\n- **Voting**:\n- Reviewing a piece of code for vulnerabilities, where several different prompts review and flag the code if they find a problem.\n- Evaluating whether a given piece of content is inappropriate, with multiple prompts evaluating different aspects or requiring different vote thresholds to balance false positives and negatives.\n\n### Workflow: Orchestrator-workers\n\nIn the orchestrator-workers workflow, a central LLM dynamically breaks down tasks, delegates them to worker LLMs, and synthesizes their results.\n\n**When to use this workflow:** This workflow is well-suited for complex tasks where you can’t predict the subtasks needed (in coding, for example, the number of files that need to be changed and the nature of the change in each file likely depend on the task). Whereas it’s topographically similar, the key difference from parallelization is its flexibility—subtasks aren't pre-defined, but determined by the orchestrator based on the specific input.\n\n**Example where orchestrator-workers is useful:**\n\n- Coding products that make complex changes to multiple files each time.\n- Search tasks that involve gathering and analyzing information from multiple sources for possible relevant information.\n\n### Workflow: Evaluator-optimizer\n\nIn the evaluator-optimizer workflow, one LLM call generates a response while another provides evaluation and feedback in a loop.\n\n**When to use this workflow:** This workflow is particularly effective when we have clear evaluation criteria, and when iterative refinement provides measurable value. The two signs of good fit are, first, that LLM responses can be demonstrably improved when a human articulates their feedback; and second, that the LLM can provide such feedback. This is analogous to the iterative writing process a human writer might go through when producing a polished document.\n\n**Examples where evaluator-optimizer is useful:**\n\n- Literary translation where there are nuances that the translator LLM might not capture initially, but where an evaluator LLM can provide useful critiques.\n- Complex search tasks that require multiple rounds of searching and analysis to gather comprehensive information, where the evaluator decides whether further searches are warranted.\n\n### Agents\n\nAgents are emerging in production as LLMs mature in key capabilities—understanding complex inputs, engaging in reasoning and planning, using tools reliably, and recovering from errors. Agents begin their work with either a command from, or interactive discussion with, the human user. Once the task is clear, agents plan and operate independently, potentially returning to the human for further information or judgement. During execution, it's crucial for the agents to gain “ground truth” from the environment at each step (such as tool call results or code execution) to assess its progress. Agents can then pause for human feedback at checkpoints or when encountering blockers. The task often terminates upon completion, but it’s also common to include stopping conditions (such as a maximum number of iterations) to maintain control.\n\nAgents can handle sophisticated tasks, but their implementation is often straightforward. They are typically just LLMs using tools based on environmental feedback in a loop. It is therefore crucial to design toolsets and their documentation clearly and thoughtfully. We expand on best practices for tool development in Appendix 2 ('Prompt Engineering your Tools').\n\n**When to use agents:** Agents can be used for open-ended problems where it’s difficult or impossible to predict the required number of steps, and where you can’t hardcode a fixed path. The LLM will potentially operate for many turns, and you must have some level of trust in its decision-making. Agents' autonomy makes them ideal for scaling tasks in trusted environments.\n\nThe autonomous nature of agents means higher costs, and the potential for compounding errors. We recommend extensive testing in sandboxed environments, along with the appropriate guardrails.\n\n**Examples where agents are useful:**\n\nThe following examples are from our own implementations:\n\n- A coding Agent to resolve [SWE-bench tasks](https://www.anthropic.com/research/swe-bench-sonnet), which involve edits to many files based on a task description;\n- Our [“computer use” reference implementation](https://github.com/anthropics/anthropic-quickstarts/tree/main/computer-use-demo), where Claude uses a computer to accomplish tasks.\n\n## Combining and customizing these patterns\n\nThese building blocks aren't prescriptive. They're common patterns that developers can shape and combine to fit different use cases. The key to success, as with any LLM features, is measuring performance and iterating on implementations. To repeat: you should consider adding complexity *only* when it demonstrably improves outcomes.\n\n## Summary\n\nSuccess in the LLM space isn't about building the most sophisticated system. It's about building the *right* system for your needs. Start with simple prompts, optimize them with comprehensive evaluation, and add multi-step agentic systems only when simpler solutions fall short.\n\nWhen implementing agents, we try to follow three core principles:\n\n1. Maintain **simplicity** in your agent's design.\n2. Prioritize **transparency** by explicitly showing the agent’s planning steps.\n3. Carefully craft your agent-computer interface (ACI) through thorough tool **documentation and testing**.\n\nFrameworks can help you get started quickly, but don't hesitate to reduce abstraction layers and build with basic components as you move to production. By following these principles, you can create agents that are not only powerful but also reliable, maintainable, and trusted by their users.\n\n### Acknowledgements\n\nWritten by Erik Schluntz and Barry Zhang. This work draws upon our experiences building agents at Anthropic and the valuable insights shared by our customers, for which we're deeply grateful.\n\n## Appendix 1: Agents in practice\n\nOur work with customers has revealed two particularly promising applications for AI agents that demonstrate the practical value of the patterns discussed above. Both applications illustrate how agents add the most value for tasks that require both conversation and action, have clear success criteria, enable feedback loops, and integrate meaningful human oversight.\n\n### A. Customer support\n\nCustomer support combines familiar chatbot interfaces with enhanced capabilities through tool integration. This is a natural fit for more open-ended agents because:\n\n- Support interactions naturally follow a conversation flow while requiring access to external information and actions;\n- Tools can be integrated to pull customer data, order history, and knowledge base articles;\n- Actions such as issuing refunds or updating tickets can be handled programmatically; and\n- Success can be clearly measured through user-defined resolutions.\n\nSeveral companies have demonstrated the viability of this approach through usage-based pricing models that charge only for successful resolutions, showing confidence in their agents' effectiveness.\n\n### B. Coding agents\n\nThe software development space has shown remarkable potential for LLM features, with capabilities evolving from code completion to autonomous problem-solving. Agents are particularly effective because:\n\n- Code solutions are verifiable through automated tests;\n- Agents can iterate on solutions using test results as feedback;\n- The problem space is well-defined and structured; and\n- Output quality can be measured objectively.\n\nIn our own implementation, agents can now solve real GitHub issues in the [SWE-bench Verified](https://www.anthropic.com/research/swe-bench-sonnet) benchmark based on the pull request description alone. However, whereas automated testing helps verify functionality, human review remains crucial for ensuring solutions align with broader system requirements.\n\n## Appendix 2: Prompt engineering your tools\n\nNo matter which agentic system you're building, tools will likely be an important part of your agent. [Tools](https://www.anthropic.com/news/tool-use-ga) enable Claude to interact with external services and APIs by specifying their exact structure and definition in our API. When Claude responds, it will include a [tool use block](https://docs.anthropic.com/en/docs/build-with-claude/tool-use#example-api-response-with-a-tool-use-content-block) in the API response if it plans to invoke a tool. Tool definitions and specifications should be given just as much prompt engineering attention as your overall prompts. In this brief appendix, we describe how to prompt engineer your tools.\n\nThere are often several ways to specify the same action. For instance, you can specify a file edit by writing a diff, or by rewriting the entire file. For structured output, you can return code inside markdown or inside JSON. In software engineering, differences like these are cosmetic and can be converted losslessly from one to the other. However, some formats are much more difficult for an LLM to write than others. Writing a diff requires knowing how many lines are changing in the chunk header before the new code is written. Writing code inside JSON (compared to markdown) requires extra escaping of newlines and quotes.\n\nOur suggestions for deciding on tool formats are the following:\n\n- Give the model enough tokens to 'think' before it writes itself into a corner.\n- Keep the format close to what the model has seen naturally occurring in text on the internet.\n- Make sure there's no formatting 'overhead' such as having to keep an accurate count of thousands of lines of code, or string-escaping any code it writes.\n\nOne rule of thumb is to think about how much effort goes into human-computer interfaces (HCI), and plan to invest just as much effort in creating good *agent*\\-computer interfaces (ACI). Here are some thoughts on how to do so:\n\n- Put yourself in the model's shoes. Is it obvious how to use this tool, based on the description and parameters, or would you need to think carefully about it? If so, then it’s probably also true for the model. A good tool definition often includes example usage, edge cases, input format requirements, and clear boundaries from other tools.\n- How can you change parameter names or descriptions to make things more obvious? Think of this as writing a great docstring for a junior developer on your team. This is especially important when using many similar tools.\n- Test how the model uses your tools: Run many example inputs in our [workbench](https://console.anthropic.com/workbench) to see what mistakes the model makes, and iterate.\n- [Poka-yoke](https://en.wikipedia.org/wiki/Poka-yoke) your tools. Change the arguments so that it is harder to make mistakes.\n\nWhile building our agent for [SWE-bench](https://www.anthropic.com/research/swe-bench-sonnet), we actually spent more time optimizing our tools than the overall prompt. For example, we found that the model would make mistakes with tools using relative filepaths after the agent had moved out of the root directory. To fix this, we changed the tool to always require absolute filepaths—and we found that the model used this method flawlessly.。", "top": 0, "createdAt": 1752321675, "style": "", "script": "", "head": "", "ogImage": "https://github.githubassets.com/favicons/favicon.svg", "createdDate": "2025-07-12", "dateLabelColor": "#0969da"}, "P4": {"htmlDir": "docs/post/Deep Research,  WebDancer,  WebSailor.html", "labels": ["AI", "Source Code"], "postTitle": "Deep Research,  WebDancer,  WebSailor", "postUrl": "post/Deep%20Research%2C%20%20WebDancer%2C%20%20WebSailor.html", "postSourceUrl": "https://github.com/winnerineast/winnerineast.github.io/issues/4", "commentNum": 0, "wordCount": 748, "description": "\n- 问：“一部知名电视剧：女二 1993 年入行；女一现任丈夫是浙江湖州人；男一六年后登上春晚。", "top": 0, "createdAt": 1752321703, "style": "", "script": "", "head": "", "ogImage": "https://github.githubassets.com/favicons/favicon.svg", "createdDate": "2025-07-12", "dateLabelColor": "#0969da"}, "P5": {"htmlDir": "docs/post/MUVERA--rang-duo-xiang-liang-jian-suo-yu-dan-xiang-liang-sou-suo-yi-yang-kuai.html", "labels": ["paper", "AI", "Source Code"], "postTitle": "MUVERA-让多向量检索与单向量搜索一样快", "postUrl": "post/MUVERA--rang-duo-xiang-liang-jian-suo-yu-dan-xiang-liang-sou-suo-yi-yang-kuai.html", "postSourceUrl": "https://github.com/winnerineast/winnerineast.github.io/issues/5", "commentNum": 0, "wordCount": 786, "description": "做RAG的朋友一定要看看 Google 这个新论文——MUVERA：让多向量检索与单向量搜索一样快 大家在RAG的检索内容过程都会遇到这种情况，如果用传统搜索（例如ElasticSearch），文档 = 1 个向量 → 快速但不准确。", "top": 0, "createdAt": 1752321737, "style": "", "script": "", "head": "", "ogImage": "https://github.githubassets.com/favicons/favicon.svg", "createdDate": "2025-07-12", "dateLabelColor": "#0969da"}, "P6": {"htmlDir": "docs/post/Optimizing ColPali for Retrieval at Scale, 13x Faster Results.html", "labels": ["AI", "Source Code"], "postTitle": "Optimizing ColPali for Retrieval at Scale, 13x Faster Results", "postUrl": "post/Optimizing%20ColPali%20for%20Retrieval%20at%20Scale%2C%2013x%20Faster%20Results.html", "postSourceUrl": "https://github.com/winnerineast/winnerineast.github.io/issues/6", "commentNum": 0, "wordCount": 6181, "description": "\nColPali is a fascinating leap in document retrieval. Its precision in handling visually rich PDFs is phenomenal, but scaling it to handle real-world datasets comes with its share of computational challenges.\n\nHere’s how we solved these challenges to make ColPali 13x faster without sacrificing the precision it’s known for.\n\n## [](https://qdrant.tech/blog/colpali-qdrant-optimization/#the-scaling-dilemma)The Scaling Dilemma\n\nColPali generates **1,030 vectors for just one page of a PDF.** While this is manageable for small-scale tasks, in a real-world production setting where you may need to store hundreds od thousands of PDFs, the challenge of scaling becomes significant.\n\nConsider this scenario:\n\n- **Dataset Size:** 20,000 PDF pages.\n- **Number of Vectors:** Each page generates ~1,000 vectors of 128 dimensions.\n\nThe total number of comparisons is calculated as:\n\n1,000⋅1,000⋅20,000⋅128=2.56×1012 comparisons!\n\nThat’s trillions of comparisons needed to build the index. Even advanced indexing algorithms like **HNSW** struggle with this scale, as computational costs grow quadratically with amount of multivectors per page.\n\nWe turned to a hybrid optimization strategy combining **pooling** (to reduce computational overhead) and **reranking** (to preserve accuracy).\n\nBefore we go any deeper, watch our [Webinar video](https://www.youtube.com/live/_h6SN1WwnLs?si=n8gwiIjJ5dnfucXC) for the full demo walkthrough.\n\nFor those eager to explore, the [codebase is available here](https://github.com/qdrant/demo-colpali-optimized).\n\n## [](https://qdrant.tech/blog/colpali-qdrant-optimization/#two-stage-retrieval-process)Two-Stage Retrieval Process\n\n### [](https://qdrant.tech/blog/colpali-qdrant-optimization/#pooling)Pooling\n\nPooling is well-known in machine learning as a way to compress data while keeping important information. For ColPali, we reduced 1,030 vectors per page to just 38 vectors by pooling rows in the document’s 32x32 grid.\n\n![](https://qdrant.tech/blog/colpali-optimization/rows.png)\n\nMax and mean pooling are the two most popular types, so we decided to test both approaches on the rows of the grid. Likewise, we could apply pooling on columns, which we plan to explore in the future.\n\n- **Mean Pooling:** Averages values across rows.\n- **Max Pooling:** Selects the maximum value for each feature.\n\n32 vectors represent the pooled rows, while 6 vectors encode contextual information derived from ColPali’s special tokens (e.g., for the beginning of the sequence, and task-specific instructions like “Describe the image”).\n\nFor our experiments, we chose to preserve these 6 additional vectors.\n\n### [](https://qdrant.tech/blog/colpali-qdrant-optimization/#the-colpali-as-a-reranker-experiment)The “ColPali as a Reranker” Experiment\n\nPooling drastically reduces retrieval costs, but there’s a risk of losing fine-grained precision. To address this, we implemented a **two-stage retrieval system**, where embeddings generated with ColPali were max/mean pooled by grid rows to create lightweight vectors for the initial retrieval stage, followed by reranking with the original high-resolution embeddings:\n\n1. **Pooled Retrieval:** Quickly retrieves the top 200 candidates using lightweight pooled embeddings.\n2. **Full Reranking:** Refines these candidates using the original, high-resolution embeddings, delivering the final top 20 results.\n\n### [](https://qdrant.tech/blog/colpali-qdrant-optimization/#implementation)Implementation\n\nWe created a custom dataset with over 20,000 unique PDF pages by merging:\n\n- **ViDoRe Benchmark:** Designed for PDF documents retrieval evaluation.\n- **UFO Dataset:** Visually rich documents paired with synthetic queries [generated by Daniel van Strien](https://huggingface.co/datasets/davanstrien/ufo-ColPali).\n- **DocVQA Dataset:** A large set of document-derived Q&A pairs.\n\nEach document was processed into 32x32 grids, generating both full-resolution and pooled embeddings. **Full-resolution** embeddings consisted of 1,030 vectors per page, while **pooled embeddings** included mean and max pooling variants.\n\nAll embeddings were were stored and kept in RAM to avoid caching effects during retrieval speed experiments.\n\n### [](https://qdrant.tech/blog/colpali-qdrant-optimization/#experiment-setup)Experiment Setup\n\nWe evaluated retrieval quality with 1,000 queries. First, pooled embeddings retrieved the top 200 candidates. Then, full-resolution embeddings reranked them to produce the final top 20 results.\n\nTo measure performance, we used:\n\n- **NDCG@20:** Measures ranking quality (how well the top results align with expectations).\n- **Recall@20:** Measures the overlap between this method and the original ColPali retrieval.\n\n## [](https://qdrant.tech/blog/colpali-qdrant-optimization/#results)Results\n\nThe experiment showed promising improvements in speed and accuracy. Retrieval time improved **13x** compared to using full-resolution embeddings alone.\n\n### [](https://qdrant.tech/blog/colpali-qdrant-optimization/#metrics)Metrics\n\n|Pooling Type|NDCG@20|Recall@20|\n|---|---|---|\n|**Mean**|0.952|0.917|\n|**Max**|0.759|0.656|\n\nMean pooling preserved nearly identical quality to the original ColPali, with NDCG@20 = 0.952 and Recall@20 = 0.917. Max pooling did not perform well enough to be considered viable since it sacrificed significant accuracy without delivering a meaningful speed advantage.\n\n## [](https://qdrant.tech/blog/colpali-qdrant-optimization/#whats-next)What’s Next?\n\nFuture experiments could push these results even further:\n\n- Investigating column-wise pooling for additional compression.\n- Testing half-precision (float16) vectors to balance memory use and speed.\n- Skipping special multivectors during prefetch to streamline retrieval.\n- Combining quantization with oversampling for even faster search.\n\n### [](https://qdrant.tech/blog/colpali-qdrant-optimization/#try-it-yourself)Try It Yourself\n\nCurious to see this in action? Explore the full codebase and experiment with ColPali optimizations:\n\n- **Demo Notebook:** [GitHub Repository](https://github.com/qdrant/demo-colpali-optimized)\n- **Webinar Walkthrough:** [Watch Here](https://www.youtube.com/live/_h6SN1WwnLs?si=n8gwiIjJ5dnfucXC)。", "top": 0, "createdAt": 1752321794, "style": "", "script": "", "head": "", "ogImage": "https://github.githubassets.com/favicons/favicon.svg", "createdDate": "2025-07-12", "dateLabelColor": "#0969da"}, "P7": {"htmlDir": "docs/post/RAG -shi-zhan-fen-xiang-  - 50-60GB PDF -wen-jian-, 6000 -pian-yi-xue-lun-wen-, -neng-zuo- RAG -ma.html", "labels": ["paper", "AI", "Source Code"], "postTitle": "RAG 实战分享  - 50-60GB PDF 文件, 6000 篇医学论文, 能做 RAG 吗", "postUrl": "post/RAG%20-shi-zhan-fen-xiang-%20%20-%2050-60GB%20PDF%20-wen-jian-%2C%206000%20-pian-yi-xue-lun-wen-%2C%20-neng-zuo-%20RAG%20-ma.html", "postSourceUrl": "https://github.com/winnerineast/winnerineast.github.io/issues/7", "commentNum": 0, "wordCount": 1430, "description": "作者 Scott 是微软开发者社区 VP, 这应该也是他在开发者中遇到的实际问题, 这个问题的讨论非常激烈。", "top": 0, "createdAt": 1752321822, "style": "", "script": "", "head": "", "ogImage": "https://github.githubassets.com/favicons/favicon.svg", "createdDate": "2025-07-12", "dateLabelColor": "#0969da"}, "P8": {"htmlDir": "docs/post/Reliable Agentic RAG with LLM Trustworthiness Estimates.html", "labels": ["paper", "AI", "Source Code"], "postTitle": "Reliable Agentic RAG with LLM Trustworthiness Estimates", "postUrl": "post/Reliable%20Agentic%20RAG%20with%20LLM%20Trustworthiness%20Estimates.html", "postSourceUrl": "https://github.com/winnerineast/winnerineast.github.io/issues/8", "commentNum": 0, "wordCount": 14009, "description": "September 12, 2024\n\n- ![Chris Mauck](https://cleanlab.ai/_next/static/images/chris-2be9b6d6c9460c74034608339ff17c6d.jpg)Chris Mauck\n- ![Jonas Mueller](https://cleanlab.ai/_next/static/images/jonas-038f0156ce880eb9cff38bb91618ea1b.jpg)Jonas Mueller\n\nThis article demonstrates an agentic system to ensure reliable answers in Retrieval-Augmented Generation, while also ensuring that **latency and compute costs do not exceed the processing needed to accurately respond to complex queries**. Our system relies on _trustworthiness scores_ for LLM outputs, in order to dynamically adjust retrieval strategies until sufficient context has been retrieved to generate a trustworthy RAG answer.\n\n![Diagram of Agentic RAG with trustworthiness scores](https://cleanlab.ai/_next/static/images/RAG_diagram-cb17a3bb114e546c10eb3e8ddc68a415.png)\n\nBased on the trustworthiness score for a candidate response, the RAG Agent can choose more complex retrieval plans or approve the response for production.\n\n## Introduction\n\nRetrieval-Augmented Generation (RAG) combines the strengths of large language models (LLMs) with powerful retrieval systems to generate more accurate responses grounded in knowledge databases. Simple RAG systems retrieve relevant information to a query via semantic search based on vector embeddings of query and database contents, but this strategy fails for more complex queries.\n\n_Agentic RAG_ considers various Retrieval strategies as tools available to an LLM orchestrator that can iteratively decide which tools to call next based on what it’s seen thus far. This Agent can plan, execute, and refine multi-step retrieval processes, but it is critical to ensure latency and compute costs do not exceed what is required to produce a good answer for a user’s query. Despite advancements from LLMs → RAG → Agentic RAG with sophisticated Retrieval strategies, AI-generated responses still suffer from hallucinations today, producing incorrect or nonsensical information with unwarranted confidence.\n\nThis blog outlines an Agentic RAG system that can produce trustworthy answers even for complex queries, in a manner that keeps latency/costs in check. Our system relies on the [Trustworthy Language Model](https://cleanlab.ai/blog/trustworthy-language-model/) to score the trustworthiness of a candidate response (based on the query and currently retrieved context). When the current response is deemed untrustworthy, the Agent is tasked with orchestrating a better Retrieval strategy to improve the context. This system starts with cheaper Retrieval strategies, and dynamically tries strategies with greater runtime/costs **only for complex queries where they are necessary to produce a trustworthy RAG answer**.\n\n## Trustworthy Language Model (TLM)\n\nFor a given user query, the RAG system will retrieve relevant context, which is then fed into a LLM to produce the response. _But how do we know when the response is untrustworthy_? For instance, here is question incorrectly answered by ChatGPT with no indication it should not be trusted.\n\n![ChatGPT giving an incorrect answer](https://cleanlab.ai/_next/static/images/gpt-367eda0e9cc624b7c3497ea417db378b.png)\n\nTLM automates this determination, by producing a trustworthiness score (between 0-1) for responses from any LLM. For the above prompt & ChatGPT response:\n\n```text\ntlm.get_trustworthiness_score(prompt, response) = 0.413\n```\n\nindicating this response should not be trusted.\n\nThese scores [have been found](https://cleanlab.ai/blog/trustworthy-language-model/) to detect hallucinations and LLM errors with greater precision/recall than alternative approaches like asking the LLM to evaluate its own output or relying on token-probabilities. TLM internally estimates aleatoric and epistemic uncertainty of the LLM by combining techniques including self-reflection, probabilistic prediction, and observed consistency. You can [present](https://help.cleanlab.ai/tutorials/tlm_rag/) TLM trustworthiness scores to users of your RAG system to automatically help them understand which responses warrant further scrutiny.\n\n## Utilizing the trustworthiness score in Agentic RAG\n\nA user’s query is processed by our RAG system as follows: the Retrieval Planner Agent orchestrates a series of Retrieval strategies in order to discover relevant context, that when appended to the query, leads to an LLM response with sufficiently high trustworthiness score. The Agent is encouraged to start with faster/cheaper Retrieval strategies and only escalate to more complex Retrieval when a high trustworthiness score has not yet been achieved. As soon as a trustworthy LLM response is produced, it is returned to the user.\n\nThis high-level system can work with many types of Retrieval Planner Agent implementations (e.g. via frameworks like LangGraph and tool-use algorithms like OpenAI Function Calling), as well as all sorts of Retrieval strategies. The goal is to minimize the runtime and costs required to process most queries, while still being able to produce trustworthy responses for complex queries that necessitate more compute.\n\n### Potential Retrieval Strategies\n\nAs a concrete example, our Retrieval Planner Agent might choose from the following Retrieval strategies, increasing in time and compute complexity:\n\n1. No Retrieval\n\n- Complexity: _None_\n- The query is answerable with general knowledge the LLM already knows.\n\n2. Semantic Search (vector embedding similarity)\n\n- Complexity: _Low_\n- Vector database (Pinecone, Qdrant, Weaviate, etc.) is searched using top similarities in space of embeddings (Sentence Transformers, Voyage, etc.)\n\n3. [Hybrid Search (vector + keyword search) with Reciprocal Rank Fusion](https://www.assembled.com/blog/better-rag-results-with-reciprocal-rank-fusion-and-hybrid-search)\n\n- Complexity: _Low/Medium_\n- Knowledge database is searched via a combination of vector similarity and classical keyword search like BM25, with results rankings from different searches aggregated via the RRF method.\n\n4. [Re-Ranking](https://adasci.org/a-hands-on-guide-to-enhance-rag-with-re-ranking/) retrieved results\n\n- Complexity: _Medium_\n- A specialized re-ranker model is applied to the retrieved results from either vector or keyword search that more accurately estimates which ones are relevant to the query.\n\n5. [Query Expansion](https://docs.llamaindex.ai/en/stable/examples/query_transformations/query_transform_cookbook/)\n\n- Complexity: _Medium/High_\n- User query is rewritten into possibly multiple queries before (possibly multiple steps of) Retrieval. This includes entity recognition, separate keyword searches, and methods like [Hypothetical Document Embeddings (Hyde)](https://arxiv.org/abs/2212.10496) or [Step-Back Prompting](https://arxiv.org/abs/2310.06117).\n\n6. Chunk/Document Expansion ([Multi-Hop RAG](https://cobusgreyling.medium.com/multihop-rag-1c695794eeda), [GraphRAG](https://neo4j.com/blog/graphrag-manifesto/))\n\n- Complexity: _Medium/High_\n- Returned chunks from the vector database search are expanded by referring to the original document from which they came and traversing related documents or Knowledge Graphs like Neo4j. This may be required to find additional information that is needed for the retrieved context to be useful.\n\n## Examples of our Trustworthy Agentic RAG in action\n\nTo make things more concrete, we consider a RAG application intended to answer questions based on Nvidia’s product documentation.\n\n### Simple Query\n\nLet’s first consider a simple query that a user may pose:\n\n> **Query:** _Which component of a computer is responsible for graphics rendering?_\n\nOn the first pass, our RAG Agent chooses the least complex retrieval plan: do not retrieve anything. The response and associated trustworthiness score are:\n\n> **Response:** The component of a computer responsible for graphics rendering is the Graphics Processing Unit (GPU).\n> \n> **Trustworthiness Score:** 0.986\n\nIn this case, the RAG Agent determines the response to be trustworthy and approves the response to be used downstream.\n\n### Complex Query\n\nNow for a more complex query:\n\n> **Query:** _How many NVIDIA CUDA Cores does the RTX 4090 have?_\n\nOur RAG Agent might again initially choose to not retrieve anything, yielding:\n\n> **Response:** As of my last update in October 2022, NVIDIA has not released an RTX 4090 graphics card. Therefore, there are no official specifications.\n> \n> **Trustworthiness Score:** 0.725\n\nIt appears that the LLM used does not have access to this knowledge. This is quantified by the trustworthiness score, enabling our system to determine this is not a reliable response and then to automatically employ a more complex retrieval plan: vector embedding search. On the second pass, the context, response, and trustworthiness score are:\n\n> **Retrieved Context:**\n> \n> GeForce RTX 4090 GPU Engine Specs: NVIDIA CUDA Cores 16384 Shader Cores Ada Lovelace 83 TFLOPS Ray Tracing Cores 3rd Generation 191 TFLOPS Tensor Cores (AI) 4th Generation 1321 AI TOPS Boost Clock (GHz) 2.52 Base Clock (GHz) 2.23\n> \n> **Response:** The NVIDIA GeForce RTX 4090 features 16,384 CUDA cores.\n> \n> **Trustworthiness Score:** 0.988\n\nNice! The RAG Agent was able to dynamically up the complexity of the retrieval plan and now has a satisfactory answer with a high trustworthiness score.\n\n### More Complex Query\n\nLet’s consider a more complex query:\n\n> **Query:** _What were the key design challenges faced by NVIDIA in developing the RTX 4090, and how were they overcome?_\n\nOur RAG Agent might again initially chooses to not retrieve anything, yielding:\n\n> **Response:** The NVIDIA RTX 4090 was developed to push the boundaries of GPU performance, requiring significant advancements in architecture, thermal management, and power efficiency.\n> \n> **Trustworthiness Score:** 0.635\n\nTLM identifies this response is generic and not confidently containing the right information. In the next pass, our RAG Agent might opt for vector similarity search again, yielding:\n\n> **Retrieved Context:** NVIDIA’s RTX 4090 was anticipated to be a major leap in GPU technology. There were discussions about improving overall architecture and enhancing ray tracing capabilities. However, specific details about the challenges during its development are scarce. Some sources suggest that NVIDIA focused on maximizing performance for gaming and AI applications, but there is little concrete information on the exact hurdles faced.\n> \n> **Response:** The NVIDIA RTX 4090 focused on improving performance and ray tracing capabilities, but specific details about the challenges encountered during development are not well-documented. It is believed that NVIDIA prioritized enhancements in gaming and AI, but the exact difficulties they faced remain unclear.\n> \n> **Trustworthiness Score:** 0.805\n\nIn this pass, our RAG Agent retrieved unsatisfactory information. The corresponding moderate trustworthiness score reflects the lack of specific context. Our RAG Agent thus considers another Retrieval pass with a more complex Hybrid search strategy, yielding:\n\n> **Retrieved Context:** The RTX 4090’s development saw NVIDIA addressing several engineering hurdles. The thermal challenges were exacerbated by the sheer density of the CUDA cores, necessitating an innovative cooling solution. NVIDIA introduced a new fan design and a larger vapor chamber to dissipate heat more effectively. On the power side, the 4090 required a new power connector standard, the PCIe Gen 5 16-pin, which allowed for higher wattage delivery, ensuring stable operation under load. For AI integration, NVIDIA refined its Tensor Core technology to balance power and performance, ensuring that the 4090 could handle advanced AI workloads without bottlenecking other processes.\n> \n> **Response:** NVIDIA’s RTX 4090 development involved overcoming several key challenges, particularly around thermal management and power delivery. The GPU’s high density of 16,384 CUDA cores required an innovative cooling system, leading to the introduction of a new fan design and larger vapor chamber. Additionally, the need for higher power delivery led to the adoption of the PCIe Gen 5 16-pin connector. To integrate AI features effectively, NVIDIA refined its Tensor Core technology, balancing power and performance to handle advanced AI workloads efficiently.\n> \n> **Trustworthiness Score:** 0.975\n\nWith the expanded context, the RAG Agent produces a highly detailed and specific response that earns a high enough trustworthiness score to return to the user. That said, this higher quality answer did require additional time/costs to produce.\n\nThe same process continues for queries with greater levels of complexity. Our RAG Agent continues escalating Retrieval strategies until the trustworthiness score indicates a reliable response, or the maximum time limit is reached. If no Retrieval strategy yields a trustworthy LLM response, then our system responds that it cannot handle this question without additional clarifications/information.\n\n## Wrap Up\n\nIntegrating the Trustworthy Language Model enables Agentic RAG systems that can ensure accurate answers to complex queries while bounding latency/costs for regular queries. You can adopt this approach to navigate the delicate balance between speed, cost, and accuracy across diverse RAG applications—from customer service to specialized fields like finance, law, and medicine.\n\nWhile traditional RAG systems generate responses of unknown quality based on predefined steps to process every query, **the future of AI lies in systems that assess response trustworthiness and adapt processing plans to each query’s complexity**. Agentic RAG with the TLM offers a promising step toward this future of _reliable_ AI.\n\n## Next Steps\n\n1. Get started with the [TLM tutorials](https://help.cleanlab.ai/tutorials/tlm/).\n2. Try it instantly via the [TLM Playground](https://tlm.cleanlab.ai/).\n3. Read [benchmarks](https://cleanlab.ai/blog/trustworthy-language-model/) measuring the effectiveness of LLM trustworthiness scores.。", "top": 0, "createdAt": 1752321863, "style": "", "script": "", "head": "", "ogImage": "https://github.githubassets.com/favicons/favicon.svg", "createdDate": "2025-07-12", "dateLabelColor": "#0969da"}, "P10": {"htmlDir": "docs/post/yi-kuan-PDF-zhuan-JSON,Markdown-de-gong-ju-：Docling.html", "labels": ["AI", "Source Code"], "postTitle": "一款PDF转JSON,Markdown的工具：Docling", "postUrl": "post/yi-kuan-PDF-zhuan-JSON%2CMarkdown-de-gong-ju-%EF%BC%9ADocling.html", "postSourceUrl": "https://github.com/winnerineast/winnerineast.github.io/issues/10", "commentNum": 0, "wordCount": 115, "description": "支持详细页面布局和阅读顺序理解、表格结构恢复，元数据提取，支持OCR功能，可用于扫描的PDF \n\ngithub：[https://github.com/DS4SD/docling](https://t.co/AOYqyN8JN5)。", "top": 0, "createdAt": 1752321905, "style": "", "script": "", "head": "", "ogImage": "https://github.githubassets.com/favicons/favicon.svg", "createdDate": "2025-07-12", "dateLabelColor": "#0969da"}, "P11": {"htmlDir": "docs/post/wu-da-zhu-liu-Agentic-kuang-jia-you-lie-dui-bi-fen-xi.html", "labels": ["AI", "Source Code"], "postTitle": "五大主流Agentic框架优劣对比分析", "postUrl": "post/wu-da-zhu-liu-Agentic-kuang-jia-you-lie-dui-bi-fen-xi.html", "postSourceUrl": "https://github.com/winnerineast/winnerineast.github.io/issues/11", "commentNum": 0, "wordCount": 1080, "description": "\n「微软、OpenAI 等科技巨头推出的五大多 AI 代理框架各具特色，AutoGen 适合开发、CrewAI 易上手、LangGraph 最灵活、Swarm 最简单、Magnetic-One 较全能，开发者该怎么选呢？」 1. AutoGen\n\n[@pyautogen](https://x.com/pyautogen)\n\n- 优势: - 最早且最流行的框架 - 特别适合软件开发任务 - 有微软强大的社区支持 - 基于用户代理和助手代理的交互模式 - 局限: - 对非程序员不够友好 - 设置复杂,特别是使用本地LLM时 - 在非软件开发任务上表现一般 2. CrewAI\n\n[@crewAIInc](https://x.com/crewAIInc)\n\n- 优势: - 非常直观,主要依赖提示词编写 - 容易创建和添加新代理 - 对非技术用户友好 - 与大多数LLM提供商兼容 - 局限: - 灵活性和自定义性有限 - 主要适合基础用例 - 代理之间的交互存在一些bug - 社区支持有限 3. LangGraph\n\n[@LangChainAI](https://x.com/LangChainAI)\n\n- 优势: - 建立在LangChain之上,基于有向循环图 - 非常灵活和可定制 - 有良好的社区支持 - 可与开源LLM和各种API配合使用 - 局限: - 文档不够完善 - 对非程序员不够友好 - 需要较强的编程技能 4. OpenAI Swarm\n\n[@OpenAIDevs](https://x.com/OpenAIDevs)\n\n- 优势: - 最容易上手的框架 - 简化了代理创建和切换 - 适合快速demo - 局限: - 仅支持OpenAI API - 不适合生产部署 - 灵活性不足 - 社区支持薄弱 5. Magnetic-One (\n\n[@OpenAtMicrosoft](https://x.com/OpenAtMicrosoft)\n\n) - 优势: - 适合非程序员 - 预装5个代理(含1个管理代理) - 建立在AutoGen之上 - 局限: - 开源LLM支持复杂 - 灵活性不足 - 文档和社区支持几乎没有 作者的最终建议: - 软件开发任务选择 AutoGen - 新手入门选择 OpenAI Swarm 或 CrewAI - 复杂任务选择 LangGraph - 开源LLM使用推荐 LangGraph - 社区支持最好的是 AutoGen - 快速启动选择 CrewAI - 成本效益考虑 Magnetic-One。", "top": 0, "createdAt": 1752321931, "style": "", "script": "", "head": "", "ogImage": "https://github.githubassets.com/favicons/favicon.svg", "createdDate": "2025-07-12", "dateLabelColor": "#0969da"}, "P12": {"htmlDir": "docs/post/quan-mian-jie-ma-MLOps - -cong-gou-xiang-dao-luo-di-de-ji-qi-xue-xi-zhi-lv.html", "labels": ["AI", "Source Code"], "postTitle": "全面解码MLOps - 从构想到落地的机器学习之旅", "postUrl": "post/quan-mian-jie-ma-MLOps%20-%20-cong-gou-xiang-dao-luo-di-de-ji-qi-xue-xi-zhi-lv.html", "postSourceUrl": "https://github.com/winnerineast/winnerineast.github.io/issues/12", "commentNum": 0, "wordCount": 724, "description": "<img width='1818' height='1892' alt='Image' src='https://github.com/user-attachments/assets/792fc6af-5295-4faa-8570-fb3f33be16d6' />\n\n这张图展示了一个端到端的MLOps（机器学习运维）架构，分为几个关键步骤和区域。", "top": 0, "createdAt": 1752321994, "style": "", "script": "", "head": "", "ogImage": "https://github.githubassets.com/favicons/favicon.svg", "createdDate": "2025-07-12", "dateLabelColor": "#0969da"}, "P13": {"htmlDir": "docs/post/ru-he-da-zao-shu-yu-ni-de-ding-zhi-hua-da-mo-xing-liao-tian-ji-qi-ren.html", "labels": ["AI", "Source Code"], "postTitle": "如何打造属于你的定制化大模型聊天机器人", "postUrl": "post/ru-he-da-zao-shu-yu-ni-de-ding-zhi-hua-da-mo-xing-liao-tian-ji-qi-ren.html", "postSourceUrl": "https://github.com/winnerineast/winnerineast.github.io/issues/13", "commentNum": 0, "wordCount": 782, "description": "\n1. 文档拆解： - 首先，你得有一些文本资料（Documents）。", "top": 0, "createdAt": 1752322036, "style": "", "script": "", "head": "", "ogImage": "https://github.githubassets.com/favicons/favicon.svg", "createdDate": "2025-07-12", "dateLabelColor": "#0969da"}, "P14": {"htmlDir": "docs/post/mo-xing-zhu-ce-biao-de-quan-jing-yun-zuo.html", "labels": ["AI", "Source Code"], "postTitle": "模型注册表的全景运作", "postUrl": "post/mo-xing-zhu-ce-biao-de-quan-jing-yun-zuo.html", "postSourceUrl": "https://github.com/winnerineast/winnerineast.github.io/issues/14", "commentNum": 0, "wordCount": 457, "description": "\n揭开MLOps的核心奥秘：模型注册表的全景运作！ 这张图展示了在MLOps（机器学习运维）中，模型注册表如何作为核心环节，协调和管理整个机器学习流水线。", "top": 0, "createdAt": 1752322065, "style": "", "script": "", "head": "", "ogImage": "https://github.githubassets.com/favicons/favicon.svg", "createdDate": "2025-07-12", "dateLabelColor": "#0969da"}}, "singeListJson": {}, "labelColorDict": {"AI": "#c21255", "bug": "#d73a4a", "documentation": "#0075ca", "duplicate": "#cfd3d7", "enhancement": "#a2eeef", "good first issue": "#7057ff", "help wanted": "#008672", "invalid": "#e4e669", "paper": "#8ef190", "question": "#d876e3", "Source Code": "#25b1d1", "wontfix": "#ffffff"}, "displayTitle": "Winnerineast Blog", "faviconUrl": "https://github.githubassets.com/favicons/favicon.svg", "ogImage": "https://github.githubassets.com/favicons/favicon.svg", "primerCSS": "<link href='https://mirrors.sustech.edu.cn/cdnjs/ajax/libs/Primer/21.0.7/primer.css' rel='stylesheet' />", "homeUrl": "https://winnerineast.github.io", "prevUrl": "disabled", "nextUrl": "disabled"}